Repository: lenoryv/collective.spanishdocumentation
Catalog: installing-plone/installing-plone-level1.tmx
Source language: en_us
Languages: es_ve

source: The install.sh script for the Unified Installer may be run as root (typically via sudo) or as a normal user.
es_ve: El script install.sh para el instalador Unificado puede ser ejecutado como root (típicamente usando el comando sudo) o como un usuario normal.

source: Key differences are:
es_ve: Las diferencias claves son:

source: The root (production) install:
es_ve: La instalación root (usada para producción):

source: Installs by default to /usr/local/Plone;
es_ve: Instala por defecto en /usr/local/Plone;

source: Creates a "plone" user, sets this user as owner of the data files, and configures Zope to run as the effective user "plone".
es_ve: Crea un usuario "plone" y establece este usuario como propietario de los archivos de datos (Data.fs). Configura Zope para correr como el usuario efectivo "plone".

source: Program and configuration files are owned by the root user, and should not be writable by the Zope process.
es_ve: Los archivos de programa y configuración son propiedad del usuario root, y no deberían modificarse por los procesos de Zope.

source: The normal (non-root) user install:
es_ve: La instalación de usuario normal (no root):

source: Installs by default to $HOME/Plone;
es_ve: Instala por defecto en $HOME/Plone;

source: Is meant to be run by and under the effective user id of the installing user.
es_ve: Esta destinada a ser ejecutada por y bajo el identificador efectivo de usuario de la persona que instala.

source: Why Choose root or normal?
es_ve: ¿Por qué escoger entre instalación normal o root?

source: Installing as root (or with root privileges via sudo) may be the best choice for a production installation of Plone.
es_ve: Instalar como root (o con privilegios root a través de sudo) puede ser la mejor opción para instalaciones de producción de Plone.

source: Since this install runs under the user id of a user created specifically for this purpose, it should have a more controllable level of access to resources.
es_ve: Ya que la instalación se ejecuta bajo el identificador de un usuario creado específicamente para este propósito, debería tener un nivel de control de acceso más alto a los recursos.

source: It is a generally accepted "best practice" to run persistent processes (like Zope) as unique users with limited rights.
es_ve: Generalmente esto es aceptado como la "mejor practica"; ejecutar procesos persistentes (como Zope) por medio de usuarios únicos con permisos limitados.

source: If you install via root, though, be careful not to run "sudo bin/buildout" except in offline mode since this would immediately run setup downloaded programs.
es_ve: De igual forma al instalar como root, tenga cuidado y no ejecute "sudo bin/buildout" excepto cuando esté trabajando offline (sin conexión), ya que si no lo hace inmediatamente ejecutara una setup (instalación) de los programas descargados.

source: Instead, obtain distribution files from validated sources, put them in buildout-cache/download/dist and run buildout in offline mode.
es_ve: En lugar de esto, obtenga archivos de distribución de fuentes validadas, colóquelas en buildout-cache/download/dist y ejecute buildout en el modo sin conexión.

source: Installing as a normal user (perhaps with your own user identity) may be a better choice for a test or development instance.
es_ve: La instalación como usuario normal (quizás con su propria identificación de usuario) puede ser la mejor opción para una instancia de prueba o desarrollo.

source: It makes it very easy to install and edit custom products without worrying about user rights or identities.
es_ve: Se hace muy sencillo instalar y editar productos personalizados sin tener que preocuparse por los derechos o identidades de los usuarios.

source: To ZEO or Not to Zeo?
es_ve: ¿Ser ZEO o no ser ZEO?

source: The Unified Installer will install Zope to either run in a Client/Server or stand-alone configuration.
es_ve: El instalador Unificado instalará Zope ya sea para ejecutarse en una configuración Cliente/Servidor o en una configuración autónoma.

source: Here are the merits of each.
es_ve: Aquí están los méritos de ambas.

source: The Unified Installer offers two different strategies for your Zope configuration:
es_ve: El instalador Unificado ofrece dos estrategias distintas para la configuración de Zope:

source: A ZEO Client/Server configuration.
es_ve: Una configuración ZEO de Cliente/Servidor.

source: ZEO (Zope Enterprise Objects) allows you to have several Zope clients processes (or separate servers) that share a common object database server process.
es_ve: ZEO (del inglés Zope Enterprise Objects) le permite tener varios procesos de clientes Zope (o servidores separados) que comparten una base común de datos de objetos de procesos de servidores.

source: A stand-alone Zope instance.
es_ve: Una instancia autónoma de Zope.

source: The stand-alone Zope instance is simpler to understand, integrate and control, and is probably the best choice for a simple or test environment.
es_ve: La instancia autónoma de Zope es más fácil de entender, integrar y controlar, y probablemente es la mejor opción para un entorno sencillo o de prueba.

source: The ZEO Client/Server configuration, though, has several advantages for production or development use:
es_ve: La configuración ZEO Cliente/Servidor, no obstante, posee algunas ventajas para el uso de producción y también desarrollo.

source: Better load balancing options.
es_ve: Mejores opciones de balanceo de carga.

source: Even without a load-balancing proxy, running independent client and server processes can spread the load better on modern multi-core servers.
es_ve: Incluso sin un proxy de balanceo de cargas, clientes independientes y procesos de servidores pueden distribuir mejor las cargas en servidores modernos multi-núcleo.

source: With a load-balancing proxy, even better results are possible.
es_ve: Con un proxy de balanceo de carga, mejores resultados son posibles.

source: The ability to run scripts against a live site.
es_ve: La capacidad de ejecutar scripts contra un sitio en producción.

source: You may use "zopectl run" to run scripts on one of the clients while others serve the site to the Internet.
es_ve: Usted puede usar "zopectl run" para ejecutar scripts en alguno de los clientes mientras que otros sirven el sitio a Internet.

source: Better debugging.
es_ve: Mejor depuración.

source: You may run one client in debug mode while the rest run in production mode.
es_ve: Usted puede correr un cliente en modo depuración mientras que el resto corre en modo producción.

source: You may then have improved diagnostics for the debug instance.
es_ve: De esta manera puede mejorar los diagnósticos para la instancia de depuración.

source: You'll also be able to use introspection tools like Clouseau and "zopectl debug" against a live site.
es_ve: También podrá usar herramientas de introspección como Clouseau y el comando "zopectl debug" en contra de un sitio en producción.

source: You may reserve a client for administrative access (it'll have its own port).
es_ve: Usted puede reservar un cliente para acceso administrativo (tendrá su propio puerto).

source: Then, if you're slashdotted before you're ready, you'll be able to make changes via the administrative client even when your public client slows down.
es_ve: Luego si usted tiene un incremento súbito en la demanda del sitio antes de que esté listo, podrá realizar cambios a través del cliente administrativo, incluso cuando su cliente público se ralentice.

source: Running the Unified Installer
es_ve: Ejecutando el instalador Unificado

source: Preparing to run and running the Unified Installer
es_ve: Preparar la ejecución y ejecutar el instalador Unificado.

source: Preparations
es_ve: Preparaciones

source: Crank up your platform's package manager and make sure you've got the following installed:
es_ve: Verifique su plataforma de administrador de paquetes y asegúrese que tenga los siguientes instalados:

source: gcc, the GNU Compiler Collection.
es_ve: gcc, La colección del Compilador GNU.

source: g++, the C++ extensions for gcc.
es_ve: g++, Las extensiones de C++ para gcc.

source: GNU make, the fundamental build-control tool.
es_ve: GNU make, la herramienta fundamental de control y construcción.

source: This is the version of tar on all Linux, BSD and OS X platforms, but not Solaris.
es_ve: Esta es la versión de tar para todos las plataformas Linux, BSD y OS X, pero no Solaris.

source: bzip2 and gzip decompression packages.
es_ve: Paquetes para descomprimir: bzip2 y gzip.

source: gzip is nearly standard; some platforms will require that bzip2 be installed.
es_ve: Paquetes para descompresión bzip2 y gzip. gzip es casi estándar; en algunas plataformas será requerida la instalación del paquete bzip2.

source: Ideally, you should also have the libssl and readline libraries and development headers loaded (usually, the libssl-dev and readline-dev packages).
es_ve: Idealmente debería tener también las librerías libssl y readline , y los encabezados de desarrollo cargados (usualmente los paquetes libssl-dev y readline-dev).

source: These are not required, but add desirable functionality.
es_ve: Realmente estos no son requeridas, pero agregan una funcionalidad deseable.

source: libssl is required to use TLS with your mail server, which may be vital if it's not local.
es_ve: libssl se requiere para usar TLS (Seguridad de la Capa de Transporte) con su servidor de correo electrónico, lo cual puede ser vital si este no es local.

source: See the Unified Installer README.txt for details.
es_ve: Para detalles lea el instalador Unificado README.txt

source: Now, choose a convenient working directory and unpack the .tar.gz archive (tarball) of the Unified Installer:
es_ve: Ahora escoja un directorio conveniente de trabajo para extraer el archivo .tar.gz (tarball) del instalador Unificado:

source: Then change into the newly created directory:
es_ve: Luego vaya al nuevo directorio creado:

source: ("VERSION-" will vary with release.)
es_ve: ("VERSION-" cambiará con cada versión.)

source: Running install.sh
es_ve: Ejecutando install.sh

source: If you've chosen to install with root privileges, either su to root or precede these commands with sudo.
es_ve: Si usted se decidió por la instalación con privilegios root; ya sea por el comando su a root o precediendo estos comandos con el comando sudo.

source: ZEO Installation:
es_ve: Instalación ZEO:

source: Stand-Alone Zope Installation:
es_ve: Instalación autónoma de Zope:

source: Then, sit back and watch the progress messages.
es_ve: Pues ahora acomódese y observe los mensajes de progreso.

source: If the progress messages don't start, it will typically mean that a vital installation tool is missing.
es_ve: Si los mensajes de progreso no comienzan, generalmente significa que falta alguna herramienta vital de instalación.

source: Use your package manager to install the tool, and try again.
es_ve: Use su administrador de paquetes para instalar la herramienta, y trate nuevamente.

source: If the installation succeeds, you'll see a set of instructions for starting your new Zope/Plone install.
es_ve: Si la instalación tiene éxito, usted verá un conjunto de instrucciones para la nueva instalación de Zope/Plone.

source: Make note of the password for the "admin" user.
es_ve: Haga una nota de la contraseña usada para el usuario"admin".

source: These instructions will also be available in README.txt file, and the pass word in "adminPassword.txt", in your new install.
es_ve: Estas instrucciones también estarán disponibles en el archivo README.txt, y la contraseña en el archivo "adminPassword.txt" de su nueva instalación.

source: If the installation should fail, don't panic.
es_ve: Si la instalación falla, no entre en pánico.

source: Make note of any error messages or diagnostics and, if you can't remedy the problem yourself, ask for help in the plone-setup mailing list or the #plone IRC channel.
es_ve: Anote los mensajes de errores y diagnósticos para que en el caso de que usted no pueda resolverlos por sí mismo, pida ayuda en la lista de correo de plone-setup o en el canal IRC #plone.

source: We'll need precise information about your platform and all possible diagnostic information to help.
es_ve: Nosotros necesitaremos información precisa sobre su plataforma y toda la información de diagnostico posible para ayudarlo.

source: Also, make sure to check the Platform Notes section of the README.txt file included with the installer to see if there might be a work-around or special requirement note for your platform.
es_ve: Además asegúrese de revisar la sección Notas de plataforma en el archivo README.txt que viene con el instalador para ver si hay algún tipo de trabajo o requerimiento especial en relación a su plataforma.

source: The install script creates a detailed log file, install.log, that may help diagnose an installation failure.
es_ve: El programa de instalación crea un archivo detallado de registro, llamado install.log, que puede ayudar al diagnostico de una instalación fallida.

source: Checking your installation
es_ve: Revisando su instalación

source: If your installation succeeded, try starting it by following the instructions displayed at the end of the install process (or in the README.txt file in the install directory).
es_ve: Si su instalación fue exitosa, trate de iniciarla siguiendo las instrucciones que se muestran al final del proceso de instalación (o en el archivo README.txt que está en el directorio de instalación).

source: Startup problems are uncommon, but do occasionally happen.
es_ve: Los problemas de arranque no son comunes pero de vez en cuando aparecen;

source: The most common cause is that some other process has already claimed the 8080 port (or one or more of the 8100, 8080 and 8081 ports if you're using ZEO).
es_ve: la causa más común es que otros procesos ya están usando el puerto 8080 (o uno o más de los puertos 8100, 8080 y 8081 si está usando ZEO).

source: You may wish to stop or kill the competing process if it's an old Zope/Plone installation.
es_ve: Si es así, puede detener o eliminar ese proceso en el caso de que sea una instalación vieja de Zope/Plone.

source: If not, you may reassign the ports used by your Plone installation by editing the buildout.cfg file and running bin/buildout to reassign ports.
es_ve: Si no también puede reasignar los puertos usados por su instalación de Plone al editar el archivo buildout.cfg y ejecutar bin/buildout para reasignar los puertos.

source: If the start is successful, test your installation by opening a web browser and navigating to http://localhost:8080.
es_ve: Si su arranque es exitoso, compruebe su instalación abriendo un navegador web y navegando a //localhost:8080.

source: (If you're testing on another machine, substitute your server host name for "localhost".)
es_ve: (Si esta haciendo la prueba en otra computadora, substituya el nombre (ip o url) de su servidor host por "localhost".)

source: You should see a Zope welcome message.
es_ve: Se debería mostrar un mensaje de bienvenida de Zope.

source: A test Plone site should be available at http://localhost:8080/Plone, and the Zope Management Interface at http://localhost:8080/manage.
es_ve: Un sitio de prueba debería estar disponible en http://localhost:8080/Plone, y la Interfaz de Administración de Zope (Zope Management Interface -ZMI) en http://localhost:8080/manage

source: If Zope appears to be running, but you cannot connect, check to see if a firewall may be in place and blocking the connection.
es_ve: Si aparentemente Zope está ejecutándose, pero no puede conectarse, compruebe si tal vez un cortafuegos (firewall) está emplazado y bloqueando la conexión.

source: Creating New Instances
es_ve: Creando nuevas instancias.

source: The Unified Installer may be used to create additional Zope/Plone instances.
es_ve: El instalador Unificado puede usarse para crear instancias adicionales de Zope/Plone.

source: Once you have used the Unified Installer to build a complete Plone install, you may wish to create additional working instances to run other sites (or sets of sites).
es_ve: Una vez que ha usado el instalador Unificado para realizar completamente una instalación de Plone, quizás usted quiera crear instancias de trabajo adicionales para ejecutar otros sitios (o conjunto de sitios).

source: The Unified Installer makes it possible to set up new instances that will use the Python and Zope code base of your main install.
es_ve: El instalador Unificado hace posible establecer nuevas instancias que usarán el código base de Python y Zope de la instalación principal.

source: To install a new instance, first decide whether it will be a root or normal-user install.
es_ve: Para instalar una nueva instancia, primero decida si quiere una instalación root o de usuario normal.

source: You may use the code base of a root-level install for a new root-level instance, or a non-root install for a new non-root instance.
es_ve: Usted puede usar el código base de instalaciones con nivel root para una nueva instancia con nivel root, o una instalación no-root para una instancia no-root.

source: Also, the new instance may be a ZEO or stand-alone install, independent of the choice made for the main installation.
es_ve: Además la nueva instancia que puede ser una instalación ZEO o autónoma, es independiente a la elección que haya hecho para la instalación principal.

source: The Commands
es_ve: Los Comandos

source: Change into the directory containing the install.sh file of your unpacked Universal Installer.
es_ve: Ubíquese en el directorio que contiene el archivo install.sh de su instalador Unificado desempaquetado.

source: Precede the following commands by "sudo" or by using "su -" to switch to root
es_ve: Preceda los siguientes comandos con"sudo" o "su -" para cambiar al usuario root.

source: For a ZEO cluster instance:
es_ve: Para una instancia de clúster de ZEO:

source: For a stand-alone Zope instance:
es_ve: Para una instancia autónoma de Zope.

source: new_instance_name should be a simple directory name -- not a full pathname.
es_ve: nuevo_nombre_instancia debería ser un nombre de directorio simple - y no un nombre de ruta completo.

source: The new directory will be created as a new subdirectory of your full installation and will share its Python and buildout cache.
es_ve: El nuevo directorio se creará como un nuevo subdirectorio de la instalación completa y compartirá su respectivo Python y el caché de buildout.

source: Setting New Ports
es_ve: Definiendo nuevos Puertos

source: Your new instance isn't ready to run yet, because it's set to use the default ports and will conflict with the previous installation.
es_ve: La nueva instancia aún no está lista para ejecutarse, ya que está configurada para usar los puertos por defecto y entrará en conflicto con la instalación previa.

source: Fortunately, that's easy to fix.
es_ve: Afortunadamente esto es fácil arreglar.

source: Change into the directory containing your new instance and open buildout.cfg with your favorite text editor.
es_ve: Vaya al directorio que contiene su nueva instancia y abra buildout.cfg con su editor de texto favorito.

source: If this is a standalone instance, you'll need to set a new port in just one spot:
es_ve: Si esta es una instancia autónoma, solo necesitará definir un puerto nuevo en un lugar solamente:

source: There's a little more work for a ZEO instance.
es_ve: Para la instancia ZEO se requiere un poco más de trabajo.

source: You'll need to change two http-address entries (one for each client) and the port for the ZEO server, which is set in the line:
es_ve: Usted necesitará cambiar dos entradas de http-address (una para cada cliente) y el puerto para el servidor de ZEO, el cual se define en la línea:

source: Change only the port number (8100); leave the IP address alone.
es_ve: Solo cambie el numero de puerto (8100); y no modifique la dirección IP.

source: Build It
es_ve: Construyalo

source: Save your changes and run buildout to update all the parts of the installation:
es_ve: Guarde sus cambios y ejecute buildout para actualizar todas las partes de la instalación:

source: If this is a root install, preface the command with "sudo" or use su to change to root.
es_ve: Si esta es una instalación root, anteponga el comando"sudo" o use "su -" para cambiar al usuario root.

source: You're now ready to run your new instance.
es_ve: Ahora ya está listo para correr la nueva instancia.

source: Command-Line Options
es_ve: Opciones de líneas de Comando

source: Some less commonly used Unified Installer options that may still be useful to you.
es_ve: Algunas opciones poco frecuentes del instalador Unificado, pero de igual manera siguen siendo útiles para usted.

source: You may add the following options to your install.sh command line to more finely control your installation:
es_ve: Puede agregar la siguientes opciones a su línea de comando install.sh para un control más refinado de su instalación:

source: Use to specify top-level path for installs.
es_ve: Úsela para especificar rutas de nivel superior para las instalaciones.

source: Plone instances and Python will be built inside this directory.
es_ve: Las instancias de Plone y Python se construirán dentro de este directorio.

source: In a root install, sets the effective user for running the instance.
es_ve: En una instalación root, define el usuario efectivo para ejecutar la instancia.

source: Default is 'plone'.
es_ve: Por defecto es el usuario "plone".

source: Ignored for non-root installs.
es_ve: Ignorado para las instalaciones no-root.

source: If you have an already built Python that's adequate to run Zope/Plone, you may specify it here.
es_ve: Si usted ya tiene una construcción Python adecuada para ejecutar Zope/Plone, lo puede especificar aquí.

source: virtualenv will be used to create an isolated Python environment for the installation.
es_ve: virtualenv se usará para crear un entorno aislado de Python para la instalación.

source: Your system's site library will not be touched.
es_ve: La librería del sistema de su sitio no se tocará.

source: Python 2.4 is required for Plone 3.x, Python 2.6 for Plone 4.
es_ve: Se requiere Python 2.4 para Plone 3.x, y Python 2.6 para Plone 4.

source: Your Python must meet the needs of Plone, and the installer will test it for zlib, libssl and xml support before building for it.
es_ve: Su Python debe satisfacer las necesidades de Plone, y el instalador pondrá a prueba el soporte para las librerías zlib, libssl y xml antes de construir para ellas.

source: If not specified, a random password will be generated.
es_ve: Si no se especifica, una contraseña aleatoria será generada.

source: SSL (usually OpenSSL) development libraries are needed to build a Python that will support SSL and TLS.
es_ve: Las librerías de desarrollo SSL (generalmente OpenSSL) se necesitan al construir Python para que soporten SSL (protocolo de capa de conexión segura) y TLS (protocolo para seguridad de la capa de transporte).

source: Without it, Plone will be unable to use TLS in SMTP.
es_ve: Sin ellas Plone no podrá utilizar TLS en SMTP (Protocolo Simple de Transferencia de Correo).

source: The Unified Installer will ordinarily stop if it can't find the SSL headers and libraries.
es_ve: El instalador Unificado habitualmente se detendrá si no puede encontrar el encabezado SSL y sus librerías.

source: Use this option to tell the installer that you know what you're doing, and wish to proceed without SSL.
es_ve: Use esta opción para participarle al instalador que usted sabe lo que está haciendo y que desea continuar sin las SSL.
